Repository: elysium-studio/Glance
Catalog: Glance.Weather.WinUI/Strings/*/Resources.resw
Source language: en
Languages: de, es, it, ja, ko, nl, pl, pt_br, zh_hans

# ModuleTitle
source: Weather
de: Wetter
es: Tiempo
it: Meteo
ja: 天気
ko: 날씨
nl: Weer
pl: Pogoda
pt_br: Clima
zh_hans: 天气

# ModuleDisplayName
source: Weather
de: Wetter
es: Tiempo
it: Meteo
ja: 天気
ko: 날씨
nl: Weer
pl: Pogoda
pt_br: Clima
zh_hans: 天气

# ModuleDescription
source: See current conditions with a live weather scene.
de: Aktuelle Bedingungen mit einer lebendigen Wetterszene anzeigen.
es: Consulta las condiciones actuales con una escena meteorológica animada.
it: Visualizza le condizioni attuali con una scena meteo animata.
ja: ライブ天気シーンで現在の状況を確認します。
ko: 실시간 날씨 장면으로 현재 상태를 확인합니다.
nl: Bekijk de huidige omstandigheden met een levendige weerscène.
pl: Sprawdzaj bieżące warunki na animowanej scenie pogodowej.
pt_br: Veja as condições atuais com uma cena climática animada.
zh_hans: 通过动态天气场景查看当前天气。

# ConfigureWeather
source: Set up weather
de: Wetter einrichten
es: Configurar el tiempo
it: Configura il meteo
ja: 天気を設定
ko: 날씨 설정
nl: Weer instellen
pl: Skonfiguruj pogodę
pt_br: Configurar clima
zh_hans: 设置天气

source: Weather unavailable
de: Wetter nicht verfügbar
es: Tiempo no disponible
it: Meteo non disponibile
ja: 天気を取得できません
ko: 날씨를 사용할 수 없음
nl: Weer niet beschikbaar
pl: Pogoda niedostępna
pt_br: Clima indisponível
zh_hans: 天气不可用

# AddLocationAndApiKey
source: Add a location and OpenWeather API key in settings
de: Ort und OpenWeather-API-Schlüssel in den Einstellungen hinzufügen
es: Añade una ubicación y una clave de API de OpenWeather en Configuración
it: Aggiungi una località e una chiave API OpenWeather nelle impostazioni
ja: 設定で場所と OpenWeather API キーを追加してください
ko: 설정에서 위치와 OpenWeather API 키를 추가하세요
nl: Voeg een locatie en OpenWeather-API-sleutel toe in Instellingen
pl: Dodaj lokalizację i klucz API OpenWeather w ustawieniach
pt_br: Adicione uma localização e uma chave da API OpenWeather nas configurações
zh_hans: 请在设置中添加位置和 OpenWeather API 密钥

source: Location not set
de: Kein Ort festgelegt
es: Ubicación no establecida
it: Località non impostata
ja: 場所が未設定です
ko: 위치가 설정되지 않음
nl: Locatie niet ingesteld
pl: Nie ustawiono lokalizacji
pt_br: Localização não definida
zh_hans: 未设置位置

source: Weather details unavailable
de: Wetterdetails nicht verfügbar
es: Detalles no disponibles
it: Dettagli meteo non disponibili
ja: 天気の詳細を取得できません
ko: 날씨 세부 정보를 사용할 수 없음
nl: Weerdetails niet beschikbaar
pl: Szczegóły pogody niedostępne
pt_br: Detalhes do clima indisponíveis
zh_hans: 天气详情不可用

source: Updating weather
de: Wetter wird aktualisiert
es: Actualizando el tiempo
it: Aggiornamento meteo
ja: 天気を更新しています
ko: 날씨 업데이트 중
nl: Weer bijwerken
pl: Aktualizowanie pogody
pt_br: Atualizando clima
zh_hans: 正在更新天气

# CheckWeatherSettings
source: Check the location, API key, and connection
de: Ort, API-Schlüssel und Verbindung prüfen
es: Comprueba la ubicación, la clave y la conexión
it: Controlla località, chiave API e connessione
ja: 場所、API キー、接続を確認してください
ko: 위치, API 키 및 연결을 확인하세요
nl: Controleer locatie, API-sleutel en verbinding
pl: Sprawdź lokalizację, klucz API i połączenie
pt_br: Verifique a localização, a chave da API e a conexão
zh_hans: 请检查位置、API 密钥和连接

# WeatherStatistics
source: Feels {0}° · {1}% humidity · {2}
de: Gefühlt {0}° · {1}% Luftfeuchte · {2}
es: Sensación {0}° · {1}% humedad · {2}
it: Percepita {0}° · umidità {1}% · {2}
ja: 体感 {0}° · 湿度 {1}% · {2}
ko: 체감 {0}° · 습도 {1}% · {2}
nl: Voelt als {0}° · {1}% luchtvochtigheid · {2}
pl: Odczuwalna {0}° · wilgotność {1}% · {2}
pt_br: Sensação {0}° · umidade {1}% · {2}
zh_hans: 体感 {0}° · 湿度 {1}% · {2}

source: Refresh weather
de: Wetter aktualisieren
es: Actualizar el tiempo
it: Aggiorna meteo
ja: 天気を更新
ko: 날씨 새로 고침
nl: Weer vernieuwen
pl: Odśwież pogodę
pt_br: Atualizar clima
zh_hans: 刷新天气

# WeatherApiKeySettingCard.Header
source: OpenWeather API key
de: OpenWeather-API-Schlüssel
es: Clave de API de OpenWeather
it: Chiave API OpenWeather
ja: OpenWeather API キー
ko: OpenWeather API 키
nl: OpenWeather-API-sleutel
pl: Klucz API OpenWeather
pt_br: Chave da API OpenWeather
zh_hans: OpenWeather API 密钥

# WeatherApiKeySettingCard.Description
source: Use your free OpenWeather API key to retrieve current conditions.
de: Kostenlosen OpenWeather-API-Schlüssel für aktuelle Bedingungen verwenden.
es: Usa tu clave gratuita de OpenWeather para obtener las condiciones actuales.
it: Usa la tua chiave OpenWeather gratuita per ottenere le condizioni attuali.
ja: 無料の OpenWeather API キーで現在の天気を取得します。
ko: 무료 OpenWeather API 키로 현재 날씨를 가져옵니다.
nl: Gebruik je gratis OpenWeather-API-sleutel voor de huidige omstandigheden.
pl: Użyj bezpłatnego klucza OpenWeather, aby pobierać bieżące warunki.
pt_br: Use sua chave gratuita do OpenWeather para obter as condições atuais.
zh_hans: 使用免费的 OpenWeather API 密钥获取当前天气。

# WeatherLocationSettingCard.Header
source: Location
de: Ort
es: Ubicación
it: Località
ja: 場所
ko: 위치
nl: Locatie
pl: Lokalizacja
pt_br: Localização
zh_hans: 位置

# WeatherLocationSettingCard.Description
source: Enter a city, optionally followed by a country code.
de: Stadt und optional einen Ländercode eingeben.
es: Introduce una ciudad y, opcionalmente, un código de país.
it: Inserisci una città e, facoltativamente, un codice paese.
ja: 都市名と、必要に応じて国コードを入力します。
ko: 도시와 선택적으로 국가 코드를 입력하세요.
nl: Voer een stad in, eventueel gevolgd door een landcode.
pl: Wpisz miasto i opcjonalnie kod kraju.
pt_br: Digite uma cidade e, opcionalmente, o código do país.
zh_hans: 输入城市，也可以附加国家/地区代码。

# WeatherLocationTextBox.PlaceholderText
source: London, GB
de: Berlin, DE
es: Madrid, ES
it: Roma, IT
ja: 東京, JP
ko: 서울, KR
nl: Amsterdam, NL
pl: Warszawa, PL
pt_br: São Paulo, BR
zh_hans: 北京, CN

# WeatherUnitsSettingCard.Header
source: Temperature unit
de: Temperatureinheit
es: Unidad de temperatura
nl: Temperatuureenheid
pl: Jednostka temperatury
pt_br: Unidade de temperatura

# WeatherUnitsSettingCard.Description
source: Choose how temperatures are displayed.
de: Wählen Sie, wie Temperaturen angezeigt werden.
es: Elige cómo se muestran las temperaturas.
nl: Kies hoe temperaturen worden weergegeven.
pl: Wybierz sposób wyświetlania temperatury.
pt_br: Escolha como as temperaturas são exibidas.

# WeatherCelsiusOption.Content
source: Celsius
pl: Celsjusz

# WeatherScenePreviewSettingCard.Header
source: Preview weather scene
de: Wetterszene anzeigen
es: Vista previa de la escena meteorológica
nl: Voorbeeld van weerscène
pl: Podgląd sceny pogodowej
pt_br: Visualizar cena do clima

# WeatherScenePreviewSettingCard.Description
source: Override live conditions to test the animated background.
de: Aktuelle Bedingungen überschreiben, um den animierten Hintergrund zu testen.
es: Sustituye las condiciones en directo para probar el fondo animado.
nl: Overschrijf het actuele weer om de geanimeerde achtergrond te testen.
pl: Zastąp bieżącą pogodę, aby przetestować animowane tło.
pt_br: Substitua as condições atuais para testar o fundo animado.

# WeatherSceneLiveOption.Content
source: Live weather
de: Aktuelles Wetter
es: Tiempo en directo
nl: Actueel weer
pl: Bieżąca pogoda
pt_br: Clima atual

# WeatherSceneClearOption.Content
source: Clear
de: Klar
es: Despejado
nl: Helder
pl: Bezchmurnie
pt_br: Limpo

# WeatherSceneHotOption.Content
source: Hot
de: Heiß
es: Caluroso
nl: Heet
pl: Upał
pt_br: Quente

# WeatherScenePartlyCloudyOption.Content
source: Partly cloudy
de: Teilweise bewölkt
es: Parcialmente nublado
nl: Gedeeltelijk bewolkt
pl: Częściowe zachmurzenie
pt_br: Parcialmente nublado

# WeatherSceneCloudyOption.Content
source: Cloudy
de: Bewölkt
es: Nublado
nl: Bewolkt
pl: Pochmurno
pt_br: Nublado

# WeatherSceneRainOption.Content
source: Rain
de: Regen
es: Lluvia
nl: Regen
pl: Deszcz
pt_br: Chuva

# WeatherSceneSnowOption.Content
source: Snow
de: Schnee
es: Nieve
nl: Sneeuw
pl: Śnieg
pt_br: Neve

# WeatherSceneThunderstormOption.Content
source: Thunderstorm
de: Gewitter
es: Tormenta
nl: Onweer
pl: Burza
pt_br: Tempestade

# WeatherSceneFogOption.Content
source: Fog
de: Nebel
es: Niebla
nl: Mist
pl: Mgła
pt_br: Nevoeiro

# WeatherApiKeyRequired
source: Enter your OpenWeather API key.
de: Geben Sie Ihren OpenWeather-API-Schlüssel ein.
es: Introduce tu clave de API de OpenWeather.
nl: Voer je OpenWeather-API-sleutel in.
pl: Wprowadź klucz API OpenWeather.
pt_br: Insira sua chave de API do OpenWeather.

# WeatherApiKeyInvalidFormat
source: This does not look like a valid OpenWeather API key.
de: Dies sieht nicht wie ein gültiger OpenWeather-API-Schlüssel aus.
es: Esto no parece una clave de API de OpenWeather válida.
nl: Dit lijkt geen geldige OpenWeather-API-sleutel.
pl: Ta wartość nie wygląda jak prawidłowy klucz API OpenWeather.
pt_br: Este valor não parece ser uma chave de API válida do OpenWeather.

# WeatherApiKeyRejected
source: OpenWeather rejected this API key. New keys can take time to activate.
de: OpenWeather hat diesen API-Schlüssel abgelehnt. Neue Schlüssel benötigen möglicherweise etwas Zeit zur Aktivierung.
es: OpenWeather ha rechazado esta clave de API. Las claves nuevas pueden tardar en activarse.
nl: OpenWeather heeft deze API-sleutel geweigerd. Het activeren van nieuwe sleutels kan even duren.
pl: OpenWeather odrzucił ten klucz API. Aktywacja nowych kluczy może potrwać.
pt_br: O OpenWeather rejeitou esta chave de API. Novas chaves podem levar algum tempo para serem ativadas.

# WeatherApiKeyRateLimited
source: This API key has reached its OpenWeather request limit.
de: Dieser API-Schlüssel hat sein OpenWeather-Anfragelimit erreicht.
es: Esta clave de API ha alcanzado su límite de solicitudes de OpenWeather.
nl: Deze API-sleutel heeft de OpenWeather-aanvraaglimiet bereikt.
pl: Ten klucz API osiągnął limit żądań OpenWeather.
pt_br: Esta chave de API atingiu o limite de solicitações do OpenWeather.

# WeatherLocationRequired
source: Enter a location for the weather forecast.
de: Geben Sie einen Ort für die Wettervorhersage ein.
es: Introduce una ubicación para la previsión meteorológica.
nl: Voer een locatie voor de weersverwachting in.
pl: Wprowadź lokalizację prognozy pogody.
pt_br: Insira um local para a previsão do tempo.

# WeatherLocationInvalid
source: Enter a city, optionally followed by a two-letter country code.
de: Geben Sie eine Stadt ein, optional gefolgt von einem zweistelligen Ländercode.
es: Introduce una ciudad, seguida opcionalmente por un código de país de dos letras.
nl: Voer een plaats in, eventueel gevolgd door een landcode van twee letters.
pl: Wprowadź miasto, opcjonalnie z dwuliterowym kodem kraju.
pt_br: Insira uma cidade, opcionalmente seguida por um código de país de duas letras.

# WeatherLocationNotFound
source: OpenWeather could not find this location.
de: OpenWeather konnte diesen Ort nicht finden.
es: OpenWeather no ha podido encontrar esta ubicación.
nl: OpenWeather kon deze locatie niet vinden.
pl: OpenWeather nie znalazł tej lokalizacji.
pt_br: O OpenWeather não encontrou este local.

# WeatherUnitsSettingCard.Header
source: Use Fahrenheit
it: Usa Fahrenheit
ja: 温度の単位
ko: 화씨 사용
zh_hans: 温度单位

# WeatherUnitsSettingCard.Description
source: Show temperatures in Fahrenheit instead of Celsius.
it: Mostra le temperature in Fahrenheit anziché Celsius.
ja: 温度の表示単位を選択します。
ko: 섭씨 대신 화씨로 온도를 표시합니다.
zh_hans: 选择温度的显示方式。
